# 데이터 탐색하기

## 1. 데이터 그룹분석

### # 데이터 가져오기

In [1]:
import pandas as pd
import numpy as np

In [2]:
# 파일 경로 지정
file_path = "./data/exam_sample.csv"

# 파일을 읽어 들여서 DataFrame 형태로 읽어드리기
df= pd.read_csv(file_path)

df

   student_no class  science  english  math sex
0           1     A       50       98    50   m
1           2     A       60       97    60   w
2           3     A       78       86    45   w
3           4     A       58       98    30   m
4           5     B       65       80    90   w
5           6     B       98       89    50   m
6           7     B       45       90    80   m
7           8     B       25       78    90   w
8           9     C       15       98    20   w
9          10     C       45       93    50   w

In [26]:
df.describe()

       student_no   science    english       math
count    10.00000  10.00000  10.000000  10.000000
mean      5.50000  53.90000  90.700000  56.500000
std       3.02765  24.09449   7.498889  23.810595
min       1.00000  15.00000  78.000000  20.000000
25%       3.25000  45.00000  86.750000  46.250000
50%       5.50000  54.00000  91.500000  50.000000
75%       7.75000  63.75000  97.750000  75.000000
max      10.00000  98.00000  98.000000  90.000000

### # 반별 그룹화

In [151]:
df1 = df.groupby(["class"])

In [152]:
df1.head()

   student_no class  science  english  math sex
0           1     A       50       98    50   m
1           2     A       60       97    60   w
2           3     A       78       86    45   w
3           4     A       58       98    30   m
4           5     B       65       80    90   w
5           6     B       98       89    50   m
6           7     B       45       90    80   m
7           8     B       25       78    90   w
8           9     C       15       98    20   w
9          10     C       45       93    50   w

### # 반별 그룹화 확인
  * 그룹별로 첫번째 데이터 출력

In [153]:
df1.head(1)

   student_no class  science  english  math sex
0           1     A       50       98    50   m
4           5     B       65       80    90   w
8           9     C       15       98    20   w

In [154]:
df1.head(2)

   student_no class  science  english  math sex
0           1     A       50       98    50   m
1           2     A       60       97    60   w
4           5     B       65       80    90   w
5           6     B       98       89    50   m
8           9     C       15       98    20   w
9          10     C       45       93    50   w

### # 특정 그룹 데이터 조회

In [157]:
print(df.groupby(["class"]).get_group("A"))

# ----- 혹은

df1 = df.groupby(["class"])

print(df1.get_group("A"))

   student_no class  science  english  math sex
0           1     A       50       98    50   m
1           2     A       60       97    60   w
2           3     A       78       86    45   w
3           4     A       58       98    30   m
   student_no class  science  english  math sex
0           1     A       50       98    50   m
1           2     A       60       97    60   w
2           3     A       78       86    45   w
3           4     A       58       98    30   m

### # 반별 그룹 평균
  * 숫자값이 있는 컬럼만 처리됨

In [32]:
df.groupby("class").mean()

       student_no  science  english   math
class
A             2.5    61.50    94.75  46.25
B             6.5    58.25    84.25  77.50
C             9.5    30.00    95.50  35.00

### # 성별로 그룹화

In [33]:
df.groupby(["sex"])

In [34]:
df.groupby(["sex"]).head(1)

   student_no class  science  english  math sex
0           1     A       50       98    50   m
1           2     A       60       97    60   w

### # 반별 및 성별로 그룹화

In [35]:
df.groupby(["class", "sex"])

In [36]:
df.groupby(["class", "sex"]).head(1)

   student_no class  science  english  math sex
0           1     A       50       98    50   m
1           2     A       60       97    60   w
4           5     B       65       80    90   w
5           6     B       98       89    50   m
8           9     C       15       98    20   w

### # 성별 평균

In [38]:
df.groupby(["sex"]).mean()

     student_no  science    english       math
sex
m      4.500000    62.75  93.750000  52.500000
w      6.166667    48.00  88.666667  59.166667

### # 반별 및 성별 평균

In [41]:
df.groupby(["class", "sex"]).mean()

           student_no  science  english  math
class sex
A     m           2.5     54.0     98.0  40.0
      w           2.5     69.0     91.5  52.5
B     m           6.5     71.5     89.5  65.0
      w           6.5     45.0     79.0  90.0
C     w           9.5     30.0     95.5  35.0

### # 반별 수학점수의 평균
  * df 전체 데이터를 사용

In [66]:
df.groupby("class")["math"].mean()

class
A    46.25
B    77.50
C    35.00
Name: math, dtype: float64

In [70]:
df["math"].groupby(df["class"]).mean()

class
A    46.25
B    77.50
C    35.00
Name: math, dtype: float64

In [74]:
df.groupby("class").mean()[["math"]]

        math
class
A      46.25
B      77.50
C      35.00

### # 반별로 수학 응시생 수 조회

In [76]:
df.groupby("class").count()[["math"]]

       math
class
A         4
B         4
C         2

### # 성별 수학점수 평균 조회

In [79]:
df.groupby("sex").mean()[["math"]]

          math
sex
m    52.500000
w    59.166667

In [81]:
sex_group = df.groupby("sex")

In [84]:
sex_group.head(1)

   student_no class  science  english  math sex
0           1     A       50       98    50   m
1           2     A       60       97    60   w

### # 실제 데이터가 어떻게 구성되어 있는지 확인

In [85]:
sex_group.groups

{'m': [0, 3, 5, 6], 'w': [1, 2, 4, 7, 8, 9]}

### # 성별 그룹 기준 남학생만 조회

In [91]:
sex_group.get_group("m")

   student_no class  science  english  math sex
0           1     A       50       98    50   m
3           4     A       58       98    30   m
5           6     B       98       89    50   m
6           7     B       45       90    80   m

### # 성별 그룹 기준 남학생 수학평균

In [100]:
m = sex_group.get_group("m")

m

   student_no class  science  english  math sex
0           1     A       50       98    50   m
3           4     A       58       98    30   m
5           6     B       98       89    50   m
6           7     B       45       90    80   m

In [101]:
type(m)

pandas.core.frame.DataFrame

In [106]:
m[["math", "sex"]].mean()

C:\Users\admin\AppData\Local\Temp/ipykernel_9476/424026567.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  m[["math", "sex"]].mean()

math    52.5
dtype: float64

## 2. 재구조화

### # cut : 데이터 구간화
  * 범주형 데이터로 만들기 위해

In [110]:
# 3구간으로 나누기

df1 = pd.cut(df["math"], 3)

df1

0    (43.333, 66.667]
1    (43.333, 66.667]
2    (43.333, 66.667]
3     (19.93, 43.333]
4      (66.667, 90.0]
5    (43.333, 66.667]
6      (66.667, 90.0]
7      (66.667, 90.0]
8     (19.93, 43.333]
9    (43.333, 66.667]
Name: math, dtype: category
Categories (3, interval[float64, right]): [(19.93, 43.333] < (43.333, 66.667] < (66.667, 90.0]]

In [118]:
df2 = df["math"].groupby(df1)

df2.head()

0    50
1    60
2    45
3    30
4    90
5    50
6    80
7    90
8    20
9    50
Name: math, dtype: int64

### # 그룹변수를 기초통계

In [116]:
df3 = df2.agg(["count", "mean", "std", "min", "max"])

df3

                  count       mean       std  min  max
math
(19.93, 43.333]       2  25.000000  7.071068   20   30
(43.333, 66.667]      5  51.000000  5.477226   45   60
(66.667, 90.0]        3  86.666667  5.773503   80   90

### # qcut() : 동일 데이터 개수로 구간을 나누기

In [119]:
pd.qcut(df["math"], 3)

0    (19.999, 50.0]
1      (50.0, 60.0]
2    (19.999, 50.0]
3    (19.999, 50.0]
4      (60.0, 90.0]
5    (19.999, 50.0]
6      (60.0, 90.0]
7      (60.0, 90.0]
8    (19.999, 50.0]
9    (19.999, 50.0]
Name: math, dtype: category
Categories (3, interval[float64, right]): [(19.999, 50.0] < (50.0, 60.0] < (60.0, 90.0]]

### # labels = False : 범주의 번호 표시
  * 해당 데이터가 어느 구간에 속하는지 숫자로 표시

In [120]:
df4 = pd.qcut(df["math"], 3, labels = False)

df4

0    0
1    1
2    0
3    0
4    2
5    0
6    2
7    2
8    0
9    0
Name: math, dtype: int64

### # np.arange() : 구간 숫자 재지정

In [131]:
df5 = pd.qcut(df["math"], 3, labels = np.arange(3, 0, -1))

df5

0    3
1    2
2    3
3    3
4    1
5    3
6    1
7    1
8    3
9    3
Name: math, dtype: category
Categories (3, int64): [3 < 2 < 1]

### # range( , , )
  * 첫번째 값 : 시작값
  * 두번째 값 : 끝값 -1 
  * 세번째 값 : 증가값 or 감소값

In [135]:
for i in range(0,3,1) :
    print(i)

print("---------")

for j in range(3,0,-1) :
    print(j)

0
1
2
---------
3
2
1

In [136]:
for i in np.arange(0,3,1) :
    print(i)

print("---------")

for j in np.arange(3,0,-1) :
    print(j)

0
1
2
---------
3
2
1

### # qcut 기초통계

In [125]:
df6 = df["math"].groupby(df5)

df6.head()

0    50
1    60
2    45
3    30
4    90
5    50
6    80
7    90
8    20
Name: math, dtype: int64

In [130]:
df7 = df6.agg(["count", "mean", "std", "min", "max"])

df7

      count       mean        std  min  max
math
3         6  40.833333  12.812754   20   50
2         1  60.000000        NaN   60   60
1         3  86.666667   5.773503   80   90

### # 3. get_dummis() : 원-핫 인코딩
  * 보통 get_dummies() 함수는 숫자값을 제외한 object(문자) 데이터 타입에 대해 자동으로 나눈다.
  * 범주형이 아닌 컴럼에 대해서 범주형 만들면 가능
  * 해당 one-hot 인코딩 되는 원본 컬럼은 없엊고, 해당 '컬럼명_범주명'으로 컬럼이 만들어진다.

### # df의 데이터 타입 확인

In [141]:
df.dtypes

student_no     int64
class         object
science        int64
english        int64
math           int64
sex           object
dtype: object

In [142]:
df_onehot = pd.get_dummies(df)

df_onehot

   student_no  science  english  math  class_A  class_B  class_C  sex_m  sex_w
0           1       50       98    50        1        0        0      1      0
1           2       60       97    60        1        0        0      0      1
2           3       78       86    45        1        0        0      0      1
3           4       58       98    30        1        0        0      1      0
4           5       65       80    90        0        1        0      0      1
5           6       98       89    50        0        1        0      1      0
6           7       45       90    80        0        1        0      1      0
7           8       25       78    90        0        1        0      0      1
8           9       15       98    20        0        0        1      0      1
9          10       45       93    50        0        0        1      0      1

### # get_dummies()

In [145]:
df_onehot2 = pd.get_dummies(df["sex"])

df_onehot2

   m  w
0  1  0
1  0  1
2  0  1
3  1  0
4  0  1
5  1  0
6  1  0
7  0  1
8  0  1
9  0  1

## 4. 데이터 전치
### # 행열 전환
  * 컬럼 -> 행 인덱스로 바뀌고
  * 행 인덱스 번호 -> 컬럼명으로 바뀐다.

In [146]:
df.T

             0   1   2   3   4   5   6   7   8   9
student_no   1   2   3   4   5   6   7   8   9  10
class        A   A   A   A   B   B   B   B   C   C
science     50  60  78  58  65  98  45  25  15  45
english     98  97  86  98  80  89  90  78  98  93
math        50  60  45  30  90  50  80  90  20  50
sex          m   w   w   m   w   m   m   w   w   w

### # 피봇 테이블

In [6]:
pd.pivot_table(df, index = "class",
               columns = "sex",
               values = "science")

sex       m     w
class
A      54.0  69.0
B      71.5  45.0
C       NaN  30.0

In [7]:
pd.pivot_table(df, index = "sex",
               columns = "class",
               values = "science")

class     A     B     C
sex
m      54.0  71.5   NaN
w      69.0  45.0  30.0